docs: make login page documentation more visual
